Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Provide the name and types in parentheses. That's Rust syntax
ru: Укажите имя и типы in в круглых скобках. Это синтаксис языка Rust

source: pub mod exposes the module; its contents remain private by default
ru: pub mod раскрывает модуль; по умолчанию его содержимое остается закрытым

source: pub use is only for std
ru: pub use только for std

source: pub use performs a re-export
ru: pub use осуществляет реэкспорт

source: pub use shortens the internal path and re-exports the name for external use
ru: pub use сокращает внутренний путь и реэкспортирует имя for во внешний use

source: Public
ru: Общественность

source: Public from private interfaces
ru: Публичные и частные интерфейсы

source: Public types and Private types
ru: Публичные типы и частные типы

source: push accepts only a char
ru: push принимает только char

source: push_str takes &str and appends it
ru: push_str берет &amp;str и добавляет его

source: Put files in src/bin
ru: Поместите файлы in src/bin

source: Puts current thread to sleep, giving others a chance
ru: Откладывает текущую нить, давая возможность другим

source: Queries and commands should be mixed
ru: Запросы и команды должны быть смешанными

source: Quit is always a String
ru: Увольнение - это всегда String

source: Quit is unit-like; Write stores a String. Variants may or may not contain data
ru: Quit - это единица; Write сохраняет String. Варианты могут содержать или не содержать данные

source: quote converts syntax structures back to Rust code
ru: цитата преобразует синтаксические структуры обратно в код Rust

source: Quotes code
ru: Код котировок

source: race resolves with whichever future finishes first
ru: гонка разрешается тем, чье будущее финиширует первым

source: RAII is a pattern where resource initialization happens in constructor and cleanup in destructor
ru: RAII - это паттерн where происходит инициализация ресурсов in конструктор и очистка in деструктор

source: RAII pattern via Drop
ru: Шаблон RAII через Drop

source: Raise an error to indicate deserialization failed
ru: Вызывает ошибку, указывающую на неудачную десериализацию

source: Random
ru: Случайный

source: Range of i16:
ru: Ассортимент i16:

source: Range of u8:
ru: Ассортимент u8:

source: Range slicing yields &str, but only on valid char boundaries
ru: Нарезка диапазона дает результат &amp;str, но только на действительных границах char

source: Ranges in patterns only work with char and numeric types
ru: Шаблоны диапазонов in работают только с char и числовыми типами

source: Rate App
ru: Оставить отзыв

source: Raw pointers are created with &raw const for *const T and &raw mut for *mut T
ru: Сырые указатели создаются с помощью &amp;raw const for *const T и &amp;raw mut for *mut T

source: Raw pointers can ignore borrowing rules, allowing multiple mutable pointers
ru: Сырые указатели могут игнорировать правила заимствования, что позволяет использовать несколько изменяемых указателей

source: Rc is reference counting, but only for single thread
ru: Rc подсчитывает количество ссылок, но только for один поток

source: Rc is shared owner, Box is single
ru: Rc является общим владельцем, Box единственный

source: Rc is single owner, Box is shared
ru: Rc один владелец, Box совместный

source: Rc<Cell<i32>>
ru: Rc&lt;Ячейка&lti32

source: Rc<Mutex<i32>>
ru: Rc&ltMutex&lt;i32&gt;&gt;

source: Rc<RefCell<i32>>
ru: Rc&ltRefCell&lt;i32&gt;&gt;

source: Rc<T> gives only immutable access; for mutation — interior mutability through RefCell
ru: Rc<T> предоставляет только неизменяемый доступ; for мутация - внутренняя изменяемость через RefCell

source: Rc<T> internally manages one copy of data and increases reference count when cloned
ru: Rc<T> внутренне управляет одной копией данных и увеличивает количество ссылок при клонировании

source: Re-declaring with let using the same name
ru: Повторное объявление на let с тем же именем

source: Re-exporting (pub use) simplifies a public API
ru: Реэкспорт (pub use ) упрощает публичный API

source: Read-only - need &mut for mutation
ru: Только для чтения - потребность иmut for мутация

source: Read/write lock
ru: Блокировка чтения/записи

source: Reader, Processor, and Writer
ru: Читатель, процессор и писатель

source: Rebind it without mut keyword or use a nested block
ru: Перепривяжите его без ключевого слова mut или use вложенного блока

source: Rebinding variables in a block scope allows selective moving, cloning, and borrowing into closures
ru: Перепривязка переменных in в области видимости блока позволяет выборочно перемещать, клонировать и заимствовать их в закрытия

source: Receiver implements Iterator
ru: Receiver реализует Iterator

source: Recoverable → Result<T, E>, unrecoverable → panic!
ru: Восстанавливаемый → Result<T, E>, невосстановимые → паника!

source: Recoverable vs. unrecoverable
ru: Восстанавливаемый и невосстанавливаемый

source: Rectangle::area = fn() { … }
ru: Прямоугольник::area = fn() { ... }

source: Rectangle::square(3)
ru: Прямоугольник::квадрат(3)

source: Rectangle.area(rect)
ru: Rectangle.area(rectangle.area(rect))

source: Recursive type of infinite size
ru: Рекурсивный type бесконечного размера

source: Recursive type where recursion goes through pointer (Box/Rc/&)
ru: Рекурсивная type where рекурсия проходит через указатель (Box/Rc/&amp;)

source: recv blocks, try_recv returns immediately
ru: recv блокируется, try_recv возвращается немедленно

source: recv is non-blocking, try_recv is blocking
ru: recv - неблокируемый, try_recv - блокирующий

source: recv waits, try_recv doesn't
ru: recv ждет, try_recv - нет

source: reduce
ru: уменьшить

source: Reduce binary size
ru: Уменьшить размер двоичных файлов

source: Reduces binary size
ru: Уменьшение размера двоичных файлов

source: Reduces boilerplate in documentation examples
ru: Сокращение количества шаблонных примеров документации in

source: Reduces code size
ru: Уменьшает размер кода

source: Reduces coupling between objects
ru: Уменьшает связь между объектами

source: Ref<T>
ru: Ссылка<T>

source: RefCell is not thread-safe
ru: RefCell не является потокобезопасным

source: Reference And Initialization Interface
ru: Интерфейс ссылок и инициализации

source: Reference count modification in Rc is not thread-safe
ru: Модификация счетчика ссылок in Rc не является потокобезопасной

source: Reference lives until the end of the program
ru: Ссылка живет до конца программы

source: Reference validity duration
ru: Срок действия ссылки

source: References always require lifetimes
ru: Ссылки всегда требуют времени жизни

source: References are forbidden in Rust
ru: Ссылки запрещены in Rust

source: References need a lifetime. The compiler requires 'a
ru: Ссылки должны иметь время жизни. Компилятор требует 'a

source: Refers to the current module
ru: Относится к текущему модулю

source: Refers to the parent
ru: Относится к родителю

source: Refers to the parent module
ru: Ссылается на родительский модуль

source: Refutable
ru: Опровержимые

source: Refutable pattern might not match for some possible values
ru: Опровержимый шаблон может не match for некоторые возможные значения

source: Regular impl
ru: Обычный impl

source: Relative paths are built from the current module via self, super, or identifiers
ru: Относительные пути строятся из текущего модуля через self, super или идентификаторы

source: Rely on comments
ru: Опирайтесь на комментарии

source: Remove one import
ru: Удалить один импорт

source: Remove the pattern
ru: Удалите рисунок

source: Removes duplicates
ru: Удаляет дубликаты

source: Removes generics
ru: Удаляет дженерики

source: Removes items
ru: Удаляет предметы

source: Removes macro
ru: Удаляет macro

source: Removes None
ru: Удаляет None

source: Removes privacy from all functions
ru: Удаляет конфиденциальность из всех функций

source: Removes the first N elements
ru: Удаляет первые N элементов

source: repeat
ru: повторить

source: Repeat important code for clarity
ru: Повторите важный код for

source: Repetition syntax
ru: Синтаксис повторения

source: Replaces a value with its Default, returning the original
ru: Заменяет значение на его Default, возвращая исходное

source: Replaces RAII
ru: Заменяет RAII

source: Replaces super
ru: Заменяет super

source: Replacing enums
ru: Замена перечислений

source: Require lifetimes and often don't express needed ownership
ru: Требуют времени жизни и часто не выражают нужного права собственности

source: Required by borrow checker
ru: Требуется проверка заемщика

source: Required by the borrow checker
ru: Требуется от проверяющего

source: Required parameter
ru: Необходимый параметр

source: Requires boilerplate for pass-through methods and trait impls
ru: Требуются шаблонные for методы передачи и trait импланты

source: Requires deep inheritance hierarchies
ru: Требуются глубокие иерархии наследования

source: Requires more documentation
ru: Требуется дополнительная документация

source: Requires private fields
ru: Требуются закрытые поля

source: Requires unsafe
ru: Требуется unsafe

source: Requires unsafe implementation
ru: Требуется внедрение unsafe

source: Reserved
ru: Зарезервировано

source: Resets the builder
ru: Сброс строителя

source: Resource Acquisition Is Initialisation
ru: Приобретение ресурсов - это инициализация

source: Resource Allocation Is Initialization
ru: Распределение ресурсов и инициализация

source: Rest of values
ru: Остальные ценности

source: Restart
ru: Заново

source: Result (integers): -5 / 3
ru: Result (целые числа): -5 / 3

source: Result encapsulates success/error
ru: Result инкапсулирует успех/ошибку

source: Result of 43 % 5:
ru: Result 43 % 5:

source: Result::unwrap
ru: Result::развернуть

source: Result<(Sender<T>, Receiver<T>)>
ru: Result&lt;(Отправитель<T>, Получатель<T>)&gt;

source: Result<&File, &io::Error>
ru: Result&lt;&amp;File, &amp;io::Error&gt;

source: Result<File, io::Error>
ru: Result&lt;Файл, io::Ошибка&gt;

source: Result<Item,Err>
ru: Result&lt;Item,Err&gt

source: Result<String, io::Error>
ru: Result&lt;String, io::Error&gt;

source: Retrying
ru: Повторная попытка

source: Return ()
ru: Возврат ()

source: Return &&String
ru: Возвращение &amp;&ampString

source: Return Result
ru: Возврат Result

source: Return String by ownership
ru: Доходность String в зависимости от формы собственности

source: Returning a reference to a local - dangling references are forbidden
ru: Возврат ссылки на локаль - висячие ссылки запрещены

source: Returning the consumed argument avoids expensive cloning when retrying operations
ru: Возвращение аргумента "потреблено" позволяет избежать дорогостоящего клонирования при повторном выполнении операций

source: Returning the error to the caller
ru: Возврат ошибки вызывающей стороне

source: Returns 0
ru: Возвращается 0

source: Returns 5 as tail expression
ru: Возвращает 5 as хвостовых выражений

source: Returns a copy
ru: Возвращает копию

source: Returns a new collection
ru: Возвращает новую коллекцию

source: Returns a reference
ru: Возвращает ссылку

source: Returns a reference to the builder
ru: Возвращает ссылку на конструктор

source: Returns a value from a function
ru: Возвращает значение из функции

source: Returns an Option
ru: Возвращает Option

source: Returns another RefMut
ru: Возвращает другой RefMut

source: Returns empty
ru: Возвращает пустой

source: Returns empty path
ru: Возвращает пустой путь

source: Returns Err
ru: Возвращает Err

source: Returns i or 0 if None
ru: Возвращает i или 0 if None

source: Returns None
ru: Возвращает None

source: Returns None on None, otherwise unwraps Some
ru: Возвращает None на None, в противном случае разворачивает Some

source: Returns null
ru: Возвращает null

source: Returns only None
ru: Только возврат None

source: Returns Option
ru: Возвращает Option

source: Returns Ref
ru: Возврат рефки

source: Returns Ref/RefMut
ru: Возвращает Ref/RefMut

source: Returns Result
ru: Возвращает Result

source: Returns Some
ru: Возвращает Some

source: Returns T or panics
ru: Возвращает T или паникует

source: Returns the list of keys
ru: Возвращает список ключей

source: Returns the result of the first future to complete
ru: Возвращает результат первого завершенного будущего

source: Returns the value or calls a closure
ru: Возвращает значение или вызывает закрытие

source: Returns the value or panics
ru: Возвращает значение или вызывает панику

source: Returns tuple of sender and receiver
ru: Возвращает кортеж отправителя и получателя

source: Returns two independent RefMut
ru: Возвращает два независимых RefMut

source: Returns usize
ru: Возвращает usize

source: Returns x+1
ru: Возвращает x+1

source: Reverses iteration order
ru: Изменяет порядок итераций

source: rocket for web frameworks
ru: ракета for веб-фреймворки

source: Rules that allow omitting lifetimes in simple cases
ru: Правила, позволяющие не учитывать время жизни in простые случаи

source: Run an algorithm over each item to create a new collection
ru: Выполните алгоритм над каждым элементом, чтобы создать новую коллекцию

source: run and undo
ru: выполнить и отменить

source: Runs faster
ru: Работает быстрее

source: Runs futures in parallel
ru: Параллельный запуск фьючерсов in

source: Runtime borrow check violation
ru: Нарушение проверки заимствований во время выполнения

source: Runtime borrow checking isn't thread-safe
ru: Проверка заимствований во время выполнения не является потокобезопасной

source: Runtime borrowing rules violation
ru: Нарушение правил заимствования во время выполнения

source: Runtime configuration
ru: Конфигурация времени выполнения

source: Runtime determines method
ru: Время выполнения определяет метод

source: Runtime determines which method to call
ru: Время выполнения определяет, какой метод вызвать

source: Runtime for async
ru: Время выполнения for async

source: Runtime overhead
ru: Накладные расходы во время выполнения

source: Runtime panic
ru: Паника во время выполнения

source: Runtime panic occurs
ru: Возникает паника во время выполнения

source: Runtime polymorphism
ru: Полиморфизм во время выполнения

source: Runtime takes over their work
ru: Время выполнения берет на себя их работу

source: Runtime type conversion
ru: Время выполнения type

source: Runtime-checked reference
ru: Ссылка, проверенная временем выполнения

source: Rust aborts the thread immediately
ru: Rust немедленно прерывает поток

source: Rust also uses ->
ru: В Rust также используется -&gt

source: Rust always copies
ru: Rust всегда копирует

source: Rust auto-references as needed. Convenience for method calls
ru: Rust автоссылки as необходимы. Удобство for вызова методов

source: Rust Automatic Instance Initialization
ru: Автоматическая инициализация экземпляров Rust

source: Rust chooses the capture strategy based on the closure body
ru: Rust выбирает стратегию захвата на основе тела закрытия

source: Rust compiler
ru: Компилятор Rust

source: Rust creates distinct types for each parameter, C++ creates copies of boilerplate
ru: Rust создает отдельные типы for для каждого параметра, C++ создает копии шаблонов

source: Rust distinguishes them: rect.width (field) vs rect.width() (method)
ru: Rust различает их: rect.width (поле) против rect.width() (метод)

source: Rust doesn't allow both variants for a single module
ru: Rust не позволяет использовать оба варианта for в одном модуле

source: Rust doesn't allow constructors
ru: Rust не позволяет использовать конструкторы

source: Rust doesn't allow the same name twice in one scope
ru: Rust не позволяет дважды использовать одно и то же имя in в одной области видимости

source: Rust doesn't auto-generate getters. The language is minimalist
ru: Rust не генерирует геттеры автоматически. Язык минималистичен

source: Rust doesn't support currying, so code generation is needed per type
ru: Rust не поддерживает каррирование, поэтому требуется генерация кода на type

source: Rust doesn't support two-parameter functions
ru: Rust не поддерживает двухпараметрические функции

source: Rust expands email to email: email. It's syntactic sugar
ru: Rust расшифровывает email до email: email. Это синтаксический сахар

source: Rust forbids defining one module in two places
ru: Rust запрещает определять один модуль in в двух местах

source: Rust has hidden nulls
ru: В Rust есть скрытые нули

source: Rust has no way to define a struct that inherits fields and methods from a parent struct
ru: В Rust нет способа определить struct, который наследует поля и методы от родителя struct

source: Rust ignores the module
ru: Rust игнорирует модуль

source: Rust is expression-oriented
ru: Rust ориентирован на выражения

source: Rust lacks method overloading so multiple constructors are difficult
ru: В Rust отсутствует перегрузка методов, поэтому использование нескольких конструкторов затруднено

source: Rust language quizzes will help you reinforce the material you’ve covered and learn Rust more effectively
ru: Квизы по языку Rust помогут вам закрепить изученный материал и эффективнее освоить Rust.

source: Rust library, managed by the user
ru: Библиотека Rust, управляемая пользователем

source: Rust merges them
ru: Rust объединяет их

source: Rust requires * before the call
ru: Rust требует * перед вызовом

source: Rust requires lifetime parameters for references. Prevents dangling references
ru: Rust требует пожизненных параметров for ссылок. Предотвращает появление висячих ссылок

source: Rust standard library uses 1:1 model (OS thread per thread)
ru: Стандартная библиотека Rust использует модель 1:1 (поток ОС на поток)

source: Rust strings are null-terminated
ru: Строки Rust являются нуль-терминированными

source: Rust supports both
ru: Rust поддерживает оба варианта

source: Rust supports both styles: file.rs and dir/mod.rs
ru: Rust поддерживает оба стиля: file.rs и dir/mod.rs

source: Rust takes the first
ru: Rust занимает первое место

source: Rust takes the last
ru: Руст занимает последнее

source: Rust templates are faster
ru: Шаблоны Rust работают быстрее

source: Rust uses auto ref/deref when calling methods
ru: Rust использует авто ref/deref при вызове методов

source: Rust uses destructors via the Drop trait to run cleanup code when values go out of scope
ru: Rust использует деструкторы через Drop trait для запуска кода очистки, когда значения выходят за пределы области видимости

source: Rust uses generics for abstraction over types and trait bounds for constraints
ru: Rust использует дженерики for абстракцию над типами и trait границы for ограничений

source: Rust uses monomorphization to create distinct types, while C++ templates are meta-programming constructs
ru: Rust использует мономорфизацию для создания отдельных типов, while Шаблоны C++ - это конструкции метапрограммирования

source: Rust version
ru: Версия Rust

source: RUST_PANIC=abort
ru: RUST_PANIC=аборт

source: Rust's module system encompasses all code organization mechanisms: packages, crates, modules, pub/use, and paths
ru: Система модулей Rust включает в себя все механизмы организации кода: пакеты, ящики, модули, pub/use, и пути

source: Rust's type system takes inspiration from functional programming, enabling compile-time guarantees
ru: Система type в Rust вдохновлена функциональным программированием, что позволяет обеспечить гарантии во время компиляции

source: RUSTFLAGS="-D warnings" cargo build
ru: RUSTFLAGS="-D warnings" сборка груза

source: RustQuiz does not collect, store, or transmit any personal data. All quiz progress and results are stored locally on your device only.
ru: RustQuiz не собирает, не хранит и не передаёт персональные данные. Весь ход и результаты теста хранятся только локально на вашем устройстве.

source: s will be dropped; the reference becomes invalid
ru: будут отменены; ссылка становится недействительной

source: s1 is automatically cloned
ru: s1 автоматически клонируется

source: s1 is moved
ru: s1 перемещается

source: s1 was moved - String is not Copy
ru: s1 был перемещен - String нет Copy

source: s2 is moved
ru: s2 перемещается

source: Safe abstraction is a safe interface over unsafe code
ru: Безопасная абстракция - это безопасный интерфейс над кодом unsafe

source: Safe access without panic
ru: Безопасный доступ без паники

source: safe can be used for functions in unsafe extern blocks that are safe to call
ru: безопасно можно использовать for функции in unsafe extern блоки, которые безопасно вызывать

source: Safe mutation possible only with sole ownership
ru: Безопасная мутация возможна только при единоличном владении

source: Safe types and Unsafe types
ru: Безопасные типы и небезопасные типы

source: Safe wrapper around unsafe code
ru: Безопасная обертка вокруг кода unsafe

source: Safer than manual indexing
ru: Безопаснее, чем ручная индексация

source: Same idea as Result, but for Option
ru: Та же идея as Result, но for Option

source: Same rules - unified ownership model
ru: Те же правила - единая модель владения

source: Saving memory
ru: Сохранение памяти

source: Scalars and tuples composed entirely of Copy types
ru: Скаляры и кортежи, полностью состоящие из типов Copy

source: Scalars are on the stack - size known at compile time
ru: Скаляры находятся в стеке - их размер известен во время компиляции

source: Scaling issue where every type needs custom serialization code
ru: Проблема масштабирования where Каждому type требуется собственный код сериализации

source: Second doesn't work with Some
ru: Второй не работает с Some

source: Second language inside Rust without memory safety guarantees
ru: Второй язык внутри Rust без гарантий сохранности памяти

source: Second returns None
ru: Второй возврат None

source: See Appendix A
ru: См. Приложение А

source: self = the current module
ru: self = текущий модуль

source: Self equals the type being implemented. Syntax shorthand
ru: Self равняется type. Краткое описание синтаксиса

source: self refers to the module itself; you import both io and Write
ru: self ссылается на сам модуль; вы импортируете и io, и Write

source: Send allows ownership transfer across threads
ru: Send позволяет передавать права собственности между потоками

source: send moves the value
ru: отправить перемещает значение

source: send returns Err when receiver dropped
ru: отправка возвращает Err при падении приемника

source: send returns error
ru: отправка возвращает ошибку

source: send transfers ownership across threads
ru: передавать права собственности между потоками

source: Separate actions into objects and pass them as parameters
ru: Разделите действия на объекты и передайте им параметры as

source: Separate methods of the struct
ru: Отдельные методы struct

source: Separate methods that change state from those that return data
ru: Отделите методы, которые изменяют состояние, от тех, которые return данные

source: Separates the pattern from its arm's code
ru: Отделяет деталь от кода ее руки

source: Separation of concerns
ru: Разделение проблем

source: Sequentially
ru: Последовательно

source: Serializing objects
ru: Сериализация объектов

source: Services should reveal their implementation
ru: Сервисы должны раскрыть свою реализацию

source: Sets a time limit for receiving each item
ru: Устанавливает временной лимит for на получение каждого предмета

source: Sets the test to ignored
ru: Устанавливает значение test на игнорирование

source: Sets up a runtime and runs a future to completion
ru: Устанавливает время выполнения и запускает будущее до завершения

source: Setting RUSTFLAGS environment variable allows denying warnings without code changes
ru: Установка переменной окружения RUSTFLAGS позволяет запретить предупреждения без изменения кода

source: Settings
ru: Настройки
